tap "antoniorodr/lexy"
tap "charmbracelet/tap"
tap "danielgatis/imgcat"
tap "steipete/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Draw boxes around text
brew "boxes"
# GNU compiler collection
brew "gcc"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Statistics utility to count lines of code
brew "cloc"
# Securely send things from one computer to another
brew "croc"
# Load/unload environment variables based on $PWD
brew "direnv"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Tool for glamorous shell scripts
brew "gum"
# CLI email client written in Rust
brew "himalaya"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Modular IRC client
brew "irssi"
# Handy way to save and run project-specific commands
brew "just"
# Rainbows and unicorns in your console!
brew "lolcat"
# Securely transfers data between computers
brew "magic-wormhole"
# CLI tool for saving complete web pages as a single HTML file
brew "monolith"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# General-purpose speech recognition model
brew "openai-whisper"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Password manager
brew "pass"
# Animated pipes terminal screensaver
brew "pipes-sh"
# Send emails from your terminal
brew "pop"
# Hook preloader
brew "proxychains-ng"
# Run a command when files change
brew "reflex"
# Safe, concurrent, practical language
brew "rust"
# Spreadsheet program for the terminal, using ncurses
brew "sc-im"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Editor of encrypted files
brew "sops"
# Fast, collaborative live terminal sharing over the web
brew "sshx"
# Tool Command Language
brew "tcl-tk"
# Terminal multiplexer
brew "tmux"
# Anonymizing overlay network for TCP
brew "tor", restart_service: :changed
# Use SOCKS-friendly applications with Tor
brew "torsocks"
# Command-line tool for sharing terminal over the web
brew "ttyd"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Your CLI home video recorder
brew "vhs"
# Extensible IRC client
brew "weechat"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# CLI tool that fetches programming tutorials from "Learn X in Y Minutes" directly into your terminal.
brew "antoniorodr/lexy/lexy"
# A powerful terminal-based AI assistant for developers, providing intelligent coding assistance directly in your terminal.
brew "charmbracelet/tap/crush"
# AI on the command line
brew "charmbracelet/tap/mods"
# A personal key value store 🛼
brew "charmbracelet/tap/skate"
# A tasty, self-hostable Git server for the command line🍦
brew "charmbracelet/tap/soft-serve"
# The SSH directory
brew "charmbracelet/tap/wishlist"
# Display images and gifs in your terminal
brew "danielgatis/imgcat/imgcat"
# Grep the GIF. Stick the landing
brew "steipete/tap/gifgrep"
# Google CLI for Gmail, Calendar, Drive, and Contacts
brew "steipete/tap/gogcli"
# Send and read iMessage / SMS from the terminal
brew "steipete/tap/imsg"
cask "font-monaspace"
cask "font-ubuntu-nerd-font"
vscode "benjaminbenais.copilot-theme"
vscode "bmewburn.vscode-intelephense-client"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "golang.go"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "openai.chatgpt"
vscode "rust-lang.rust-analyzer"
go "github.com/air-verse/air"
go "golang.org/x/tools/gopls"
go "github.com/golang-migrate/migrate/v4/cmd/migrate"
go "github.com/cespare/reflex"
go "github.com/sqlc-dev/sqlc/cmd/sqlc"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "cross"
cargo "freenet"
flatpak "app.zen_browser.zen"
flatpak "chat.simplex.simplex"
flatpak "com.discordapp.Discord"
flatpak "com.protonvpn.www"
flatpak "com.vivaldi.Vivaldi"
flatpak "io.github.celluloid_player.Celluloid"
flatpak "io.github.flattool.Warehouse"
flatpak "io.github.peazip.PeaZip"
flatpak "io.github.picocrypt.Picocrypt"
flatpak "it.mijorus.smile"
flatpak "org.gimp.GIMP"
flatpak "org.kiwix.desktop"
flatpak "org.telegram.desktop"
